verification/runs/F7_runs/F7a_R1/res16_calpha0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

a       0.05715;
convertToMeters 1;

vertices
(
    (0                  0                    0)
    (#calc "15.0*$a"   0                    0)
    (#calc "15.0*$a"   #calc "1.25*$a"     0)
    (0                  #calc "1.25*$a"     0)
    (0                  0                    #calc "$a/240")
    (#calc "15.0*$a"   0                    #calc "$a/240")
    (#calc "15.0*$a"   #calc "1.25*$a"     #calc "$a/240")
    (0                  #calc "1.25*$a"     #calc "$a/240")
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (240 20 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    leftWall  { type wall; faces ( (0 4 7 3) ); }
    rightWall { type wall; faces ( (1 2 6 5) ); }
    lowerWall { type wall; faces ( (0 1 5 4) ); }
    atmosphere{ type wall; faces ( (3 7 6 2) ); }
    defaultFaces { type empty; faces ( (0 3 2 1) (4 5 6 7) ); }
);

mergePatchPairs ();

// *********************************************************************** //
